{"data":{"site":{"siteMetadata":{"title":"Bart Widlarz's Blog"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"A piece of advice For leaders Introducing one on one meetings is an evolutionary process rather than a\nrevolution. It takes some time to…","fields":{"slug":"/1on1part3/"},"frontmatter":{"date":"March 13, 2019","title":"1on1s part 3, Advice","description":"When you first invite somebody to a meeting, the message should be clear — it’s for us to talk. And the first meeting should be exactly like that."}}},{"node":{"excerpt":"Benefits for the company There are a couple of undebatable benefits of conducting such meetings. The\nexact implementation varies depending…","fields":{"slug":"/1on1part2/"},"frontmatter":{"date":"March 05, 2019","title":"1on1s part 2, Why run them?","description":"This time the focus is on why we should even bother running meetings like that. There are a couple of undebatable benefits of conducting such meetings."}}},{"node":{"excerpt":"A 1-on-1, or one on one meeting is a basic, yet a crucial tool to facilitate\ncommunication in your organization. It is achieved by regular…","fields":{"slug":"/1on1/"},"frontmatter":{"date":"March 01, 2019","title":"1-on-1 Meetings part 1, What","description":"What is a 1-on-1 meeting, what to discuss and what to avoid? A 1-on-1, or one on one meeting, is a basic, yet crucial tool to facilitate communication in your organization..."}}},{"node":{"excerpt":"Some time ago I was invited to take part in React Native workshops as a mentor, \nwhich means I was supposed to help other developers go…","fields":{"slug":"/react-native-workshops/"},"frontmatter":{"date":"March 01, 2019","title":"React Native workshops","description":"Running workshops"}}},{"node":{"excerpt":"This is the first blog post here, I just wanted to say hello and post some information about me. I’m a Software Developer, Frontend & Mobile…","fields":{"slug":"/hello-world/"},"frontmatter":{"date":"February 25, 2019","title":"Hello!","description":"I just wanted to say hello."}}}]}},"pageContext":{}}