{"data":{"site":{"siteMetadata":{"title":"Bart Widlarz","author":"Bart Widlarz"}},"markdownRemark":{"id":"74b8bf76-17e8-55c0-8694-402df2dc87fc","excerpt":"A piece of advice For leaders Introducing one on one meetings is rather an evolutionary process than a\nrevolution. It takes some time to make people comfortable…","html":"<h3>A piece of advice</h3>\n<h4>For leaders</h4>\n<p>Introducing one on one meetings is rather an evolutionary process than a\nrevolution. It takes some time to make people comfortable and gain their\ninvolvement. When you first invite somebody to a meeting, the message should be\nclear — it’s for us to talk. And the first meeting should be exactly as that.</p>\n<p>You may say that it’s easier to say than do. Well, while it’s definitely easier\nto introduce the meetings when you have just joined a new team and everything\naround you is fresh, it might be terribly hard for those who have already built\na relationship with people, and now wants to introduce a mysterious new thing.\nIt’s up to them whether the benefits outweigh the loses, yet this post strongly\nencourages to place a great deal of importance on face-to-face relationships.</p>\n<h4>For those who were invited</h4>\n<p>Calm down. If you get an invitation your career is probably on the verge of\ngetting better, short of you have been conspicuously sloppy, aggressive or\nobnoxious in any way. </p>\n<hr>\n<h3>Summary</h3>\n<p>To summarize, even though it takes some doing it’s worth devoting your time to\nintroduce the convention of running one on one meetings regularly:</p>\n<ol>\n<li>Leaders are responsible for running then, not HR people,</li>\n<li>It’s not a place to discuss an issue which should be addressed through public\nchannels,</li>\n<li>There are at least three main reasons why to run the meetings. The one is that\nis that is if you know for receiving feedback from people. The second is it’s a\nway for leaders to provide mentorship. The third it’s a convenient way to\nidentify employees problems,</li>\n</ol>\n<p>Even though I mainly draw on my own experience, my knowledge is based on\nresources that I strongly recommend:</p>\n<p><a href=\"https://www.amazon.com/Hard-Thing-About-Things-Building/dp/0062273205\">The Hard Thing About Hard\nThings</a>\nby Ben Horowitz</p>\n<p><a href=\"https://www.amazon.com/Alliance-Managing-Talent-Networked-Age/dp/1625275773\">The Alliance: Managing Talent in the Networked\nAge</a>\nby Reid Hoffman</p>\n<p><a href=\"https://www.amazon.com/Managers-Path-Leaders-Navigating-Growth/dp/1491973897\">The Manager’s\nPath</a>\nby Camille Fournier</p>\n<p><a href=\"https://www.amazon.com/Extreme-Ownership-U-S-Navy-SEALs/dp/1250183863/\">Extreme\nOwnership</a>\nby Jocko Willink and Leif Babin</p>\n<p><a href=\"https://www.moznainaczej.com.pl/Download/DoktrynaJakosci/DoktrynaJako%C5%9Bci_wydanie_II.pdf\">Doktryna Jakości: Rzecz o skutecznym\nzarządzaniu</a>\nby Andrzej Blikle</p>","frontmatter":{"title":"1on1s part 3, Advice","date":"March 13, 2019","description":"When you first invite somebody to a meeting, the message should be clear — it’s for us to talk. And the first meeting should be exactly as such."}}},"pageContext":{"slug":"/1on1part3/","previous":{"fields":{"slug":"/1on1part2/"},"frontmatter":{"title":"1on1s part 2, Why to run it?"}},"next":null}}